Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t
Struct for UI selection.

Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t.ModelObject
The object we are attaching to.

Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t.Functionality
FunctionalityEnum.

Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t.nObjects
Number of objects.

Tekla.Structures.ModelInternal.dotTaskObjectAttacher_t.aObjects
Identifiers.